.src/miscellaneous/misc.org
#+TITLE: 其他


* 第 4 学期期末考试

笔试训练题:
- C# 中的值类型有哪些?
- AutoResetEvent 的哪个方法是用来让线程进入阻塞状态的？
- 使用哪些类可以实现在【字符串】和【字节码】之间进行转换？
- 有哪些常见的 BackgroundWorker 事件?
- 用来获取变量类型的操作符是哪个？
- 用来声明动态变量的关键词是哪个？
- 用来将内容写入文件的类是哪个?
- 反射的命名空间是什么？
- EF 的开发模式有哪些?
- Linq to object 的命名空间是什么?
- Linq 中，哪些操作符是延迟的，哪些是非延迟的?
- Linq to xml 中，进行保存的方法是哪个?
- XElement 的 Elements 方法表示什么意思?
- 套接字 (SocketType) 类型有哪些?
- TcpListener 让服务端进入监听的方法是什么?
- TcpClient 用于跟服务器建立连接的方法是什么?
- 请简单描述 Socket 的工作流程
