html/miscellaneous/misc.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-12-15 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>其他</title>
<meta name="author" content="1a2y" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='/html/asset/common.css?3344' />
<link rel='stylesheet' href='/yaoliuyao/html/asset/common.css?3344' />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">其他</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf15ec60">1. 第 4 学期期末考试</a></li>
</ul>
</div>
</nav>


<section id="outline-container-orgf15ec60" class="outline-2">
<h2 id="orgf15ec60"><span class="section-number-2">1.</span> 第 4 学期期末考试</h2>
<div class="outline-text-2" id="text-1">
<p>
笔试训练题:
</p>
<ul class="org-ul">
<li>C# 中的值类型有哪些?</li>
<li>AutoResetEvent 的哪个方法是用来让线程进入阻塞状态的？</li>
<li>使用哪些类可以实现在【字符串】和【字节码】之间进行转换？</li>
<li>有哪些常见的 BackgroundWorker 事件?</li>
<li>用来获取变量类型的操作符是哪个？</li>
<li>用来声明动态变量的关键词是哪个？</li>
<li>用来将内容写入文件的类是哪个?</li>
<li>反射的命名空间是什么？</li>
<li>EF 的开发模式有哪些?</li>
<li>Linq to object 的命名空间是什么?</li>
<li>Linq 中，哪些操作符是延迟的，哪些是非延迟的?</li>
<li>Linq to xml 中，进行保存的方法是哪个?</li>
<li>XElement 的 Elements 方法表示什么意思?</li>
<li>套接字 (SocketType) 类型有哪些?</li>
<li>TcpListener 让服务端进入监听的方法是什么?</li>
<li>TcpClient 用于跟服务器建立连接的方法是什么?</li>
<li>请简单描述 Socket 的工作流程</li>
</ul>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 1a2y</p>
<p class="date">Created: 2022-12-15</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
